package com.yk2;

public abstract class Figura {
    public abstract double calcArea();

    public abstract double calcPerimeter();

}

/*
Задача 2:
Написать иерархию классов Фигура, Треугольник, Прямоугольник, Круг.
Реализовать функцию подсчета площади для каждого типа фигуры и подсчет
периметра(используя абстрактный класс/методы). Создать массив из 5 разных фигур.
Вывести на экран сумму периметра всех фигур в массиве.

a, b - стороны прямоугольника, r - радиус круга, h - высота треугольника, π ≈ 3,14.

 */